{
    "feed": [
        {
            "id": "1",
            "profileImageUrl": "assets/companies/adobe.png",
            "timestamp": "10",
            "position": "Software Development Engineer",
            "jobType":"Full Time",
            "salary": "4500",
            "company": "Adobe",
            "location": "San Jose, California",
            "jobDescription": ["BS or MS in Computer Science or related field",
                "10+ years of software engineering experience managing highly sophisticated CRM implementations.",
                "Experience with Microsoft Azure services (Application servers, Database Services, Service Bus",
                "Experience in web services and integrations using HTTP and RESTful design principles"],
            "companyDescription":"Changing the world through digital experiences is what Adobe’s all about. We give everyone—from emerging artists to global brands—everything they need to design and deliver exceptional digital experiences. We’re passionate about empowering people to craft beautiful and powerful images, videos, and apps, and transform how companies interact with customers across every screen.",
            "review": ["I just joined but I felt that Adobe gives value to every individual. My manager is very focused and appreciative. It has tons of material for self-learning and is partnered with many external learning platforms. Benefits are good but the only cons I would say is managing multiple small projects at the same time when the expectation is not properly defined. It sometimes causes anxiety while filling timesheet"
            ]
        },
        {
            "id": "2",
            "profileImageUrl": "assets/companies/apple.png",
            "timestamp": "20",
            "position": "Software Engineer",
            "jobType":"Full Time",
            "salary": "4600",
            "company": "Apple",
            "location": "Cupertino, California",
            "jobDescription":["5+ years software development experience",
                "Very strong skills with Java (J2EE / J2SE) and related technologies: Spring Framework, JUnit",
                "Application development and design experience using object-oriented methodologies",
                "Hands on experience building and using REST APIs"],
            "companyDescription": "Apple Inc., formerly Apple Computer Inc., is an American multinational corporation that designs and manufactures consumer electronics and software products. The company's best-known hardware products include Macintosh computers, the iPod and the iPhone. Apple software includes the Mac OS X operating system, the iTunes media browser, the iLife suite of multimedia and creativity software, the iWork suite of productivity software, and Final Cut Studio, a suite of professional audio and film-industry software products. The company operates several hundred retail stores in a number of countries as well as the online online store and iTunes Store.",
            "review": ["Working at Apple was a great experience. Work never felt like work because I loved what I did and I loved interacting with the public. The store was always electric, although others may say crazy. I'd say electric because the experience was exhilarating.",
                "I love working for Apple. The company truly cares about its employees and provides many opportunities beyond just the job itself. I highly recommend working there"]
        },
        {
            "id": "3",
            "profileImageUrl": "assets/companies/facebook.png",
            "timestamp": "30",
            "position": "Application Security Engineer",
            "jobType":"Full Time",
            "salary": "4700",
            "company": "Facebook",
            "location": "Menlo Park, California",
            "jobDescription": ["B.S. or M.S. Computer Science or related field, or equivalent experience",
                "Experience ensuring security and privacy on the internetExperience ensuring security and privacy on the internet",
                "Knowledge of internet security issues",
                "Experience contributing to the security community (public research, blogging, presentations, etc.)"],
            "companyDescription": "Facebook, American online social network service that is part of the company Meta Platforms. Facebook was founded in 2004 by Mark Zuckerberg, Eduardo Saverin, Dustin Moskovitz, and Chris Hughes, all of whom were students at Harvard University. Facebook became the largest social network in the world, with nearly three billion users as of 2021, and about half that number were using Facebook every day. The company’s headquarters are in Menlo Park, California.",
            "review": ["Meta is going places! The market may be confused by the move to metaverse operations but this will all make sense in the years to come. Meta is full of the smartest engineers, developers, managers, etc.!",
                "Contractors are extremely underpaid, the $.90 pay raise isn’t enough to actually live and feel secure outside of the job. Micromanaged until the day you leave. Benefits aren’t anything special, bare minimum for employees who work on “data sensitive” content."
            ]
        },
        {
            "id": "4",
            "profileImageUrl": "assets/companies/google.png",
            "timestamp": "40",
            "position": "Principal Architect, Google Cloud",
            "jobType":"Full Time",
            "salary": "4800",
            "company": "Google",
            "location": "Mexico City, Mexico",
            "jobDescription": ["10 years of experience as an enterprise architect in a cloud computing environment or experience in a customer-facing role.",
                "10 years of experience in cloud computing (applications, infrastructure, storage, platforms and data), as well as cloud market and competitive dynamics." ,
                "Experience with structured Enterprise Architecture practices in hybrid cloud deployments and on-premise-to-cloud migration deployments and roadmaps."],
            "companyDescription": "Google, in full Google LLC formerly Google Inc. (1998–2017), American search engine company, founded in 1998 by Sergey Brin and Larry Page, that is a subsidiary of the holding company Alphabet Inc. More than 70 percent of worldwide online search requests are handled by Google, placing it at the heart of most Internet users’ experience. Its headquarters are in Mountain View, California.",
            "review": ["My original manager was excellent, he knew what was going on at all times. He left the office and checked on you, he also made every effort to make employees feel appreciated. He had done the job, he knew that it wasn't always pleasant lugging that mail satchel around in rain, sleet, hail or snow.",
                "Great culture and place to work for entry level. Never a dull moment. They are a very inclusive company not wanting to leave anyone out. Several programs and fun parties for employees."
            ]
        },
        {
            "id": "5",
            "profileImageUrl": "assets/companies/microsoft.png",
            "timestamp": "50",
            "position": "Principal Software Architect",
            "jobType":"Full Time",
            "salary": "4900",
            "company": "Microsoft",
            "location": "Redmond, Washington",
            "jobDescription":["10+ years in development and design experience (C++/C# and/or Java) on products or services that have shipped to customers",
                "3+ years of experience designing and building large scale distributed systems",
                "3+ years of experience leading, coaching or mentoring engineers"
                ],
            "companyDescription":"Microsoft Corporation, leading developer of personal-computer software systems and applications. The company also publishes books and multimedia titles, produces its own line of hybrid tablet computers, offers e-mail services, and sells electronic game systems and computer peripherals (input/output devices). It has sales offices throughout the world. In addition to its main research and development centre at its corporate headquarters in Redmond, Washington, U.S., Microsoft operates research labs in Cambridge, England (1997); Beijing, China (1998); Bengaluru, India (2005); Cambridge, Massachusetts (2008); New York, New York (2012); and Montreal, Canada (2015).",
            "review":["The company is unmistakably amazing, it has outstanding values, great benefits, and an overall culture that makes you feel part of the family, you learn all the time and it has an amazing diversity and inclusion spirit. Work-life balance isn't so great, and you can end up working sunrise to sunset to meet objectives, and your results are only reviewed by your manager. Great managers give you the best experience of your life; not-so-great managers make life unbearable."
            ]
        },
        {
            "id": "6",
            "profileImageUrl": "assets/companies/netflix.png",
            "timestamp": "60",
            "position": "Senior Security Software Engineer",
            "jobType":"Full Time",
            "salary": "5000",
            "company": "Netflix",
            "location": "Los Gatos, California",
            "jobDescription": ["Software development in applied cryptography especially if directed to mobile client development.",
                "Experience identifying, promoting and executing a practical balance between user experience, security needs and business needs.",
                "Developing applications in C/C++ and Java (or other managed languages) on Linux (other platforms are a plus)."],
            "companyDescription": "Netflix, in full Netflix, Inc., media-streaming and video-rental company founded in 1997 by American entrepreneurs Reed Hastings and Marc Randolph. It is also involved in the creation of original programming. Corporate headquarters are in Los Gatos, California.",
            "review": ["When Netflix shut down it's call center my heart broke. I finally felt like I had found a stable job with reasonable pay and benefits that I could work at forever and work my way up. I felt such pride working for this company and that was a huge deal for me. I wanted to work somewhere brag worthy, and that call center was it. I loved literally everyone I worked with. I'm not sure I'll ever feel as satisfied working any other job and I wish daily they didn't outsource all their call centers and shut us down. It's been years and I still miss that job."
            ]
        },
        {
            "id": "7",
            "profileImageUrl": "assets/companies/nvidia.png",
            "timestamp": "70",
            "position": "Systems Design Engineer",
            "jobType":"Full Time",
            "salary": "5100",
            "company": "NVIDIA",
            "location": "Santa Clara, California",
            "jobDescription": ["BS/MSEE or equivalent experience.",
                "2+ years of system and circuit/board design experience",
                "Proficiency with design tools such as OrCAD, Concept and Allegro",
                "Ability to deliver large and complex projects from specification through to production. Prior experience with server motherboard design is a major plus."
                ],
            "companyDescription":"NVIDIA Corporation, global corporation that manufactures graphics processors, mobile technologies, and desktop computers. The company was founded in 1993 by three American computer scientists, Jen-Hsun Huang, Curtis Priem, and Christopher Malachowsky. NVIDIA is known for developing integrated circuits, which are used in everything from electronic game consoles to personal computers (PCs). The company is a leading manufacturer of high-end graphics processing units (GPUs). NVIDIA is headquartered in Santa Clara, California.",
            "review": ["I’ve been with the company for 7 years. No promotion opportunities. They hire from outside at higher levels but don’t promote for my position. Many of the new hires don’t have as much experience. It’s frustrating knowing I’ll have to go elsewhere to advance.",
                "Excellent company to work for. Excellent people and ceo. Flexible working conditions. Future is very bright for company's goal and financially also very positive."]
        },
        {
            "id": "8",
            "profileImageUrl": "assets/companies/youtube.png",
            "timestamp": "80",
            "position": "Visual Designer",
            "jobType":"Full Time",
            "salary": "5200",
            "company": "YouTube",
            "location": "London, United Kingdom",
            "jobDescription": ["Bachelor's degree in Design (e.g., interaction, graphic, visual communications, product, industrial, etc.), Human-Computer Interaction (HCI), Computer Science (CS), a related field, or equivalent practical experience.",
                "An online portfolio showing experience designing web and mobile applications.",
                "Experience implementing design systems across a range of platforms in an iterative software development environment."],
            "companyDescription": "YouTube, Web site for sharing videos. It was registered on February 14, 2005, by Steve Chen, Chad Hurley, and Jawed Karim, three former employees of the American e-commerce company PayPal. They had the idea that ordinary people would enjoy sharing their “home videos.” The company is headquartered in San Bruno, California.",
            "review": ["I love how you can choose when or how you want to make money. making your own hours is wonderful. i also love how you can work with friends and they don’t even have to be youtubers.",
                "Its cool to be a youtuber but also it usually isnt great also you arent supported by youtube themselves mostly especially if you handle hard topics so you need a sponsorship"]
        },
        {
            "id": "9",
            "profileImageUrl": "assets/companies/ebay.png",
            "timestamp": "90",
            "position": "Flutter Engineer",
            "jobType":"Full Time",
            "salary": "5400",
            "company": "ebay",
            "location": "Remote, Texas",
            "jobDescription": ["Extensive experience with Flutter development.",
                "Experience working with medium- to large-sized teams.",
                "Experience delivery in a high-velocity environment, following agile or kanban practices.",
                "5+ years of work experience delivering mobile products."
               ],
            "companyDescription": "eBay, global online auction and trading company launched by American entrepreneur Pierre Omidyar in 1995. eBay was one of the first companies to create and market an Internet Web site to match buyers and sellers of goods and services. The company, which caters to individual sellers and small businesses, is a market leader in e-commerce worldwide. eBay is headquartered in San Jose, California.",
            "review": ["It was really swell you know it is easy to list items up for the grabs and sell them for your own prices and even bargain a few with buyers to meet your needs. Lots of time and unlimited pay. You put up and people buy you get paid in the week or so. there hardly ever any mangers watching over you but you cant give out personal information on the site for others.",
                "A lot of investment on home-grown software, Quite collaborative environment."]
        },
        {
            "id": "10",
            "profileImageUrl": "assets/companies/flutter.png",
            "timestamp": "100",
            "position": "Flutter Web Engineer",
            "jobType":"Full Time",
            "salary": "8000",
            "company": "Flutter",
            "location": "Remote, USA",
            "jobDescription": ["Software development experience in Web Frameworks, Javascript, CSS, HTML",
                "Proficient in written and verbal English",
                "Prior experience with web frameworks & technologies",
                "Experience in performance debugging and optimization and/or web client infrastructure."
            ],
            "companyDescription": "Flutter is an open-source UI software development kit created by Google. It is used to develop cross platform applications for Android, iOS, Linux, macOS, Windows, Google Fuchsia, and the web from a single codebase. First described in 2015, Flutter was released in May 2017",
            "review": ["The Company is a very good company to work for. They look after staff. I enjoy working for the company. The company have the best staff welfare package.",
                "Flutter Agency has demonstrated a good depth of knowledge and overall end-to-end expertise working with Google Cloud and Flutter. The team is communicative, flexible, and responsive, and they change their composition as needed. Additionally, they offer excellent mobile app development skills."
            ]
        }
    ]
}